# clear metodunu öz metodlarınızla yazmağa çalışın
# =================================================

# =================================================

# verilmiş siyahını digərinə tam olaraq kopyalayın
# =================================================

# =================================================

# verilmiş siyahını digərinə tam olaraq kopyalayın (comprehension metodu ilə)
# =================================================

# =================================================

# count metodunun gördüyü işi görən kodlar yazın
# =================================================

# =================================================

# index metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================

# index metodunun gördüyü işi kodlarla yazın, lakin verilən siyahının xüsusi aralığında
# =================================================

# =================================================

# insert metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================

# pop metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================

# remove metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================

# remove metodunun gördüyü işi list comprehension üsulu ilə yazın
# =================================================

# =================================================

# reverse metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================

# sort metodunun gördüyü işi kodlarla yazın
# =================================================

# =================================================
